<big><b>Step 1:</b> Load the SQL extension</big>

In [ ]:
%load_ext sql

<big><b>Step 2</b>: Connect sqlite to coursedata database</big>

In [4]:
%%sql

sqlite:///CourseData.db

'Connected: @CourseData.db'

<big><b>Step 3</b>: Use PRAGMA on the new tables to check that the structure of each table aligns with the ERD</big>

In [5]:
%%sql

PRAGMA table_info(INSTRUCTOR);

 * sqlite:///CourseData.db
Done.

[(0, 'IID', 'INTEGER', 0, None, 1), (1, 'Name', 'TEXT', 1, None, 0)]

In [6]:
%%sql

PRAGMA table_info(LOCATION);

 * sqlite:///CourseData.db
Done.

[(0, 'LID', 'INTEGER', 0, None, 1), (1, 'Location', 'TEXT', 1, None, 0)]

In [7]:
%%sql

PRAGMA table_info(PROGRAM);

 * sqlite:///CourseData.db
Done.

[(0, 'PID', 'INTEGER', 0, None, 1),
 (1, 'ProgramCode', 'TEXT', 1, None, 0),
 (2, 'ProgramName', 'TEXT', 1, None, 0)]

In [8]:
%%sql

PRAGMA table_info(CATALOG_COURSE);

 * sqlite:///CourseData.db
Done.

[(0, 'CAID', 'INTEGER', 1, None, 1),
 (1, 'CatalogID', 'TEXT', 1, None, 0),
 (2, 'ProgramName', 'TEXT', 1, None, 0),
 (3, 'Credits', 'VARCHAR', 1, None, 0),
 (4, 'Title', 'TEXT', 1, None, 0),
 (5, 'PreReqs', 'TEXT', 0, None, 0),
 (6, 'Attributes', 'TEXT', 0, None, 0),
 (7, 'Description', 'TEXT', 0, None, 0)]

In [9]:
%%sql

PRAGMA table_info(OFFERINGS_COURSE);

 * sqlite:///CourseData.db
Done.

[(0, 'COID', 'INTEGER', 0, None, 1),
 (1, 'Name', 'TEXT', 1, None, 0),
 (2, 'Meetings', 'TEXT', 1, None, 0),
 (3, 'CatalogID', 'TEXT', 1, None, 0),
 (4, 'CRN', 'TEXT', 1, None, 0),
 (5, 'Term', 'TEXT', 1, None, 0),
 (6, 'Section', 'TEXT', 1, None, 0),
 (7, 'Cap', 'INTEGER', 1, None, 0),
 (8, 'Act', 'INTEGER', 1, None, 0),
 (9, 'Rem', 'INTEGER', 1, None, 0)]

In [10]:
%%sql

PRAGMA table_info(MEETINGS_COURSE);

 * sqlite:///CourseData.db
Done.

[(0, 'CMID', 'INTEGER', 0, None, 1),
 (1, 'CRN', 'TEXT', 1, None, 0),
 (2, 'Location', 'TEXT', 1, None, 0),
 (3, 'Day', 'TEXT', 1, None, 0),
 (4, 'Start', 'TEXT', 1, None, 0),
 (5, 'End', 'TEXT', 1, None, 0)]

In [11]:
%%sql

SELECT * 
FROM INSTRUCTOR 
WHERE IID < 10;

 * sqlite:///CourseData.db
Done.

[(1, 'Michael P.  Coyne'),
 (2, 'Rebecca I.  Bloch'),
 (3, 'Paul   Caster'),
 (4, 'Jo Ann   Drusbosky'),
 (5, 'Arleen N.  Kardos'),
 (6, 'Scott M  Brenner'),
 (7, 'Kevin C.  Cassidy'),
 (8, 'Bruce   Bradford'),
 (9, 'Milo W.  Peck')]

In [29]:
%%sql

SELECT DISTINCT(Name), COUNT(*) AS Cnt
FROM OFFERINGS_COURSE
GROUP BY Name
LIMIT 10;

 * sqlite:///CourseData.db
Done.

[('01/20-04/30', 1),
 ('01/20-05/08', 4),
 ('05/21-08/17', 1),
 ('08/15-01/15', 1),
 ('09/01-12/07', 1),
 ('09/02-12/19', 1),
 ('09/02-12/30', 5),
 ('Aaron K.  Perkus', 2),
 ('Aaron R.  Van Dyke', 42),
 ('Abdel Illah A.  Douda', 17)]

In [32]:
%%sql

SELECT *
FROM OFFERINGS_COURSE
WHERE Name LIKE '0%'
LIMIT 10;

 * sqlite:///CourseData.db
Done.

[(305, '09/02-12/30', "[{'days': 'TBA', 'times': '1', 'dates': 'TBA', 'location': 'IDEA Course Eval - YES'}]", 'CN 0465', '73284', 'Fall2014', '02', 0, 1, 0),
 (706, '08/15-01/15', "[{'days': 'TBA', 'times': '10', 'dates': 'TBA', 'location': 'IDEA Course Eval - YES'}]", 'IN 0214', '73278', 'Fall2014', '01', 0, 10, 0),
 (911, '09/02-12/30', "[{'days': 'TBA', 'times': '0', 'dates': 'TBA', 'location': 'IDEA Course Eval - NO and VPA Arts Core: Applied Course'}]", 'MU 0067', '70848', 'Fall2014', 'A', 1, -1, 0),
 (917, '09/02-12/30', "[{'days': 'TBA', 'times': '0', 'dates': 'TBA', 'location': 'IDEA Course Eval - NO and VPA Arts Core: Applied Course'}]", 'MU 0088', '70302', 'Fall2014', 'B', 0, 0, 0),
 (1167, '09/02-12/30', "[{'days': 'TBA', 'times': '0', 'dates': 'TBA', 'location': 'IDEA Course Eval - NO'}]", 'PY 0099', '70620', 'Fall2014', '01', 0, 0, 0),
 (1168, '09/02-12/30', "[{'days': 'TBA', 'times': '0', 'dates': 'TBA', 'location': 'IDEA Course Eval - NO'}]", 'PY 0099', '70621', 'Fall2014', '02', 0, 0, 0),
 (1228, '09/02-12/19', "[{'days': 'TBA', 'times': '0', 'dates': 'TBA', 'location': 'IDEA Course Eval - YES'}]", 'QA 0400', '73239', 'Fall2014', '02', 0, 0, 999),
 (2313, '09/01-12/07', "[{'days': 'TBA', 'times': '0', 'dates': 'TBA', 'location': 'IDEA Course Eval - NO'}]", 'MU 0088', '75192', 'Fall2015', 'B', 0, 0, 0),
 (7334, '01/20-05/08', "[{'days': 'TBA', 'times': '0', 'dates': 'TBA', 'location': 'IDEA Course Eval - NO and Professional Studies BA and Prof Studies: Humanities and Prof Studies: Social Sciences'}]", 'CO 0570', '32930', 'Spring2015', '01', 0, 0, 0),
 (7335, '01/20-05/08', "[{'days': 'TBA', 'times': '0', 'dates': 'TBA', 'location': 'IDEA Course Eval - NO'}]", 'CO 0571', '32527', 'Spring2015', '01', 0, 0, 0)]